source/src/InformationRegisters/пэмСостояниеМетрик/пэмСостояниеМетрик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пэмСостояниеМетрик</name>
  <resources>
    <name>ДатаРасчета</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Метрика</name>
    <type>
      <types>CatalogRef.пэмМетрики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

source/src/Enums/пэмТипыМетрик/пэмТипыМетрик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пэмТипыМетрик</name>
  <enumValues>
    <name>Counter</name>
  </enumValues>
  <enumValues>
    <name>Gauge</name>
  </enumValues>
</mdclass:Enum>

source/src/Enums/пэмМетодыПолученияМетрик/пэмМетодыПолученияМетрик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пэмМетодыПолученияМетрик</name>
  <enumValues>
    <name>Pull</name>
  </enumValues>
  <enumValues>
    <name>Push</name>
  </enumValues>
</mdclass:Enum>

source/src/Catalogs/пэмМетрики/пэмМетрики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>пэмМетрики</name>
  <predefined>
    <items>
      <name>pde_metric_scrape_duration_millisecond</name>
    </items>
    <items>
      <name>pde_last_refresh_second</name>
    </items>
  </predefined>
  <attributes>
    <name>ТипМетрики</name>
    <type>
      <types>EnumRef.пэмТипыМетрик</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодПолученияМетрики</name>
    <type>
      <types>EnumRef.пэмМетодыПолученияМетрик</types>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

source/src/CommonForms/пэмНастройкиМетрик/Module.bsl
&НаКлиенте
Процедура пэмИспользоватьPushgatewayПриИзменении(Элемент)
	
	Если Константы.пэмИспользоватьPushgateway Тогда
		Константы.пэмПутьНаСервереPushgateway = "/metrics/job/pushgateway/instance/product";
		Константы.пэмАдресСервераPushgateway = "";
		Константы.пэмПортСервераPushgateway = 9091;
	Иначе
		Константы.пэмПутьНаСервереPushgateway = "";
		Константы.пэмАдресСервераPushgateway = "";
		Константы.пэмПортСервераPushgateway = 0;
	КонецЕсли;
	
	ОбновитьСостояниеФормы();
			
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПервоначальноеЗаполнениеНаСервере()
	
	ОписаниеМетрики = Справочники.пэмМетрики.pde_metric_scrape_duration_millisecond.ПолучитьОбъект();
	ОписаниеМетрики.Наименование = "Длительность расчета метрик (миллисекунд)";
	ОписаниеМетрики.ТипМетрики = Перечисления.пэмТипыМетрик.Gauge;
	ОписаниеМетрики.МетодПолученияМетрики = Перечисления.пэмМетодыПолученияМетрик.Pull;
	ОписаниеМетрики.Активность = Истина;
	ОписаниеМетрики.Алгоритм = "
	|ТаблицаЗначений = Новый ТаблицаЗначений;                             
	|ТаблицаЗначений.Колонки.Добавить(""label"", Новый ОписаниеТипов(""Строка""));
	|ТаблицаЗначений.Колонки.Добавить(""value"", Новый ОписаниеТипов(""Число""));	
	|
	|Запрос = Новый Запрос;
	|Запрос.Текст = 
	|""ВЫБРАТЬ
	||	пэмСостояниеМетрик.Метрика.Код КАК label,
	||	пэмСостояниеМетрик.Длительность КАК value
	||ИЗ
	||	РегистрСведений.пэмСостояниеМетрик КАК пэмСостояниеМетрик"";
	|Результат = Запрос.Выполнить();
	|
	|Если НЕ Результат.Пустой() Тогда
	|	ТаблицаЗначений = Результат.Выгрузить();
	|КонецЕсли;
	|";
	ОписаниеМетрики.Записать();
	
	ОписаниеМетрики = Справочники.пэмМетрики.pde_last_refresh_second.ПолучитьОбъект();
	ОписаниеМетрики.Наименование = "Последнее обновление метрик (секунд)";
	ОписаниеМетрики.ТипМетрики = Перечисления.пэмТипыМетрик.Counter;
	ОписаниеМетрики.МетодПолученияМетрики = Перечисления.пэмМетодыПолученияМетрик.Pull;
	ОписаниеМетрики.Активность = Истина;
	ОписаниеМетрики.Алгоритм = "
	|ТаблицаЗначений = Новый ТаблицаЗначений;
	|ТаблицаЗначений.Колонки.Добавить(""label"", Новый ОписаниеТипов(""Строка""));
	|ТаблицаЗначений.Колонки.Добавить(""value"", Новый ОписаниеТипов(""Число""));	
	|
	|Запрос = Новый Запрос;
	|Запрос.Текст = 
	|""ВЫБРАТЬ
	||	пэмСостояниеМетрик.Метрика.Код КАК label,
	||	РАЗНОСТЬДАТ(пэмСостояниеМетрик.ДатаРасчета, &ТекущаяДата, СЕКУНДА) КАК value
	||ИЗ
	||	РегистрСведений.пэмСостояниеМетрик КАК пэмСостояниеМетрик"";
	|Запрос.УстановитьПараметр(""ТекущаяДата"",ТекущаяДата());
	|Результат = Запрос.Выполнить();
	|
	|Если НЕ Результат.Пустой() Тогда
	|	ТаблицаЗначений = Результат.Выгрузить();
	|КонецЕсли;
	|";	
	ОписаниеМетрики.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПервоначальноеЗаполнение(Команда)
	ВыполнитьПервоначальноеЗаполнениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеФормы()
	
	Элементы.ГруппаPushgatewayСервер.Доступность = Константы.пэмИспользоватьPushgateway;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСостояниеФормы();
	
КонецПроцедуры
